Documents/ПредварительнаяЗапись.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПредварительнаяЗапись</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПредварительнаяЗапись/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	//Вызываем расчет сумм ТЧ и заполняем сумму документа
	РаботаСТЧ.ПересчитатьСуммуВСтрокеТЧ(Элементы.Услуги.ТекущиеДанные);
	РаботаСТЧ.ЗаполнитьСуммуДокумента(,Объект.Услуги.Итог("Сумма"),Объект.СуммаДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	//Вызываем расчет сумм ТЧ и заполняем сумму документа
	РаботаСТЧ.ПересчитатьСуммуВСтрокеТЧ(Элементы.Услуги.ТекущиеДанные);
	РаботаСТЧ.ЗаполнитьСуммуДокумента(,Объект.Услуги.Итог("Сумма"),Объект.СуммаДокумента);
	
КонецПроцедуры

&НаСервере
Процедура УслугиУслугаПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДатаЗаписи)Тогда
		ОбщаяДлительностьВМинутах = 0;
		Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
			ВремяТекущейНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Услуга, "ДлительностьУслуги");
			ОбщаяДлительностьВМинутах = ОбщаяДлительностьВМинутах + ВремяТекущейНоменклатуры;
		КонецЦикла;
	КонецЕсли;
	Объект.ДатаОкончанияЗаписи = Объект.ДатаЗаписи + (ОбщаяДлительностьВМинутах * 60);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаУслуги = Элементы.Услуги.ТекущиеДанные;
	СтрокаУслуги.Цена = РаботаСЦенами.ПолучитьЗаписьЦеныНаКонкретнуюДату(СтрокаУслуги.Услуга,,Объект.Дата);
	УслугиУслугаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	//Заполняем ответственного через функцию БСП
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры
